tap "caskroom/cask"
tap "homebrew/bundle"
tap "homebrew/core"

# packages
brew "bash"
brew "coreutils"
brew "curl"
brew "jpeg", args: ["universal"]
brew "libusb-compat", args: ["universal"]
brew "mas"
brew "nvm"
brew "wget"
brew "yarn"

# browsers
cask "google-chrome"

# editor
cask "visual-studio-code"

# docs
cask "macdown"
mas "Keynote", id: 409183694
mas "Pages", id: 409201541
mas "Numbers", id: 409203825


# utilities
mas "The Unarchiver", id: 425424353

# others
mas "Telegram", id: 946399090
mas "Wallcat", id: 1000397973
mas "GravitDesigner", id: 1207744923
mas "Pixelmator", id: 407963104
mas "WhatsApp", id: 1147396723
cask "spotify"
